pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_PWR</name>
                  <description>Selects the minimum power clock. This setting should be used whenever the IOM is not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>Selects the HFRC as the input clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV2</name>
                  <description>Selects the HFRC / 2 as the input clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Selects the HFRC / 4 as the input clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV8</name>
                  <description>Selects the HFRC / 8 as the input clock.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Selects the HFRC / 16 as the input clock.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV32</name>
                  <description>Selects the HFRC / 32 as the input clock.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV64</name>
                  <description>Selects the HFRC / 64 as the input clock.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOCLKEN</name>
              <description>Enable for the interface clock. Must be enabled prior to executing any IO operations.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Writes to this register will start an IO transaction, as well as set various parameters for the command itself. Reads will return the command value written to the CMD register.
To read the number of bytes that have yet to be transferred, refer to the CTSIZE field within the CMDSTAT register.</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF3FFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETLO</name>
              <description>This register holds the low order byte of offset to be used in the transaction. The number of offset bytes to use is set with bits 1:0 of the command. Offset bytes are transferred starting from the highest byte first.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSEL</name>
              <description>Command Specific selection information</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSIZE</name>
              <description>Defines the transaction size in bytes. The offset transfer is not included in this size.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Continue to hold the bus after the current transaction if set to a 1 with a new command issued.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OFFSETCNT</name>
              <description>Number of offset bytes to use for the command - 0, 1, 2, 3 are valid selections. The second (byte 1) and third byte (byte 2) are read from the OFFSETHI register, and the low order byte is pulled from this register in the OFFSETLO field.
Offset bytes are transmitted highest byte first. E.g., if OFFSETCNT == 3, OFFSETHI[15:8] will be transmitted first, then OFFSETHI[7:0] then OFFSETLO.
If OFFSETCNT == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.
If OFFSETCNT == 1, only OFFSETLO will be transmitted.
Offset bytes are always transmitted MSB first, regardless of the value of the LSB control bit within the module configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDRPT</name>
          <description>Will repeat the next command for CMDRPT number of times. If CMDRPT is set to 1, the next command will be done 2 times in series. A repeat count of up to 31 is possible. Each command will be done as a separate command, but the data will
be treated as packed, and aligned to byte boundaries. This differs when executing separate commands without the CMDRPT set, as the data for each transaction is word aligned and any unused byte locations will be filled with 0 for read operations, or
discarded for write operations. For repeated commands (CMDRPT is nonzero), the data is packed and no bytes will be filled or discarded until the final command is done.
The register value is decremented for each repeated command and at the end of the repeated command set, will be set to zero. If subsequent commands are to be repeated, this register must be written again.</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>CMDRPT</name>
              <description>Count of number of times to repeat the next command.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

