pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>CQADDR</name>
              <description>Bits 19:2 of target byte address for source of CQ (read only). The buffer must be aligned on a word boundary</description>
              <bitRange>[19:2]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQSTAT</name>
          <description>Provides the status of the command queue operation. If the command queue is disabled, these bits will be cleared. The bits are read only</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>CQERR</name>
              <description>Command queue processing error. This active high bit signals that an error was encountered during the CQ  operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command queue operation is currently paused.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQTIP</name>
              <description>Command queue Transfer In Progress indicator. 1 will indicate that a CQ transfer is active and this will remain active even when paused waiting for external event.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQFLAGS</name>
          <description>Provides the current status of the SWFLAGS (bits 7:0) and the hardware generated flags (15:8). A '1' will pause the CQ operation if it the same bit is enabled in the CQPAUSEEN register</description>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CQIRQMASK</name>
              <description>Provides for a per-bit mask of the flags used to invoke an interrupt. A '1' in the bit position will enable the pause event to trigger the interrupt, if the CQWT_int interrupt is enabled.
Bits definitions are the same as CQPAUSE</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQFLAGS</name>
              <description>Current flag status (read-only). Bits [7:0] are software controllable and bits [15:8] are hardware status.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQSETCLEAR</name>
          <description>Set/Clear the command queue software pause flags on a per-bit basis. Contains 3 fields, allowing for setting, clearing or toggling the value in the software flags. Priority when the same bit
is enabled in each field is toggle, then set, then clear.</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>CQFCLR</name>
              <description>Clear CQFlag status bits. Will clear to 0 any SWFLAG with a '1' in the corresponding bit position of this field</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQFTGL</name>
              <description>Toggle the indicated bit. Will toggle the value of any SWFLAG with a '1' in the corresponding bit position of this field</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQFSET</name>
              <description>Set CQFlag status bits. Will set to 1 the value of any SWFLAG with a '1' in the corresponding bit position of this field</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQPAUSEEN</name>
          <description>Enables a flag to pause an active command queue operation. If a bit is '1' and the corresponding bit in the CQFLAG register is '1', CQ processing will halt until either value is changed to '0'.</description>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CQPEN</name>
              <description>Enables the specified event to pause command processing when active</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNTEQ</name>
                  <description>Pauses command queue processing when HWCNT matches SWCNT</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLEXOREN</name>
                  <description>Pause command queue when input BLE bit XORed with SWFLAG4 is '1'</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMXOREN</name>
                  <description>Pause command queue when input IOM bit XORed with SWFLAG3 is '1'</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOXOREN</name>
                  <description>Pause command queue when input GPIO irq_bit XORed with SWFLAG2 is '1'</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1XNOREN</name>
                  <description>Pause command queue when input MSPI1 bit XNORed with SWFLAG1 is '1'</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0XNOREN</name>
                  <description>Pause command queue when input MSPI0 bit XNORed with SWFLAG0 is '1'</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1XOREN</name>
                  <description>Pause command queue when input MSPI1 bit XORed with SWFLAG1 is '1'</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0XOREN</name>
                  <description>Pause command queue when input MSPI0 bit XORed with SWFLAG0 is '1'</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN7</name>
                  <description>Pause the command queue when software flag bit 7 is '1'.</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN6</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN5</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN4</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN3</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN2</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAGEN1</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLGEN0</name>
                  <description>Pause the command queue when software flag bit 7 is '1'</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCURIDX</name>
          <description>Current index value, targeted to be written by register write operations within the command queue. This is compared to the CQENDIDX and will stop the CQ operation if bit 15 of the CQPAUSEEN is '1' and
this current index equals the CQENDIDX register value. This will only pause when the values are equal.</description>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CQCURIDX</name>
              <description>Holds 8 bits of data that will be compared with the CQENDIX register field. If the values match, the IDXEQ pause event will be activated, which will cause the pausing of command queue operation if the IDXEQ bit is enabled in CQPAUSEEN.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

