pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHCFG</name>
          <description>FLASH Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000873</resetValue>
          <resetMask>0x00003F7F</resetMask>

          <fields>
            <field>
              <name>LPMMODE</name>
              <description>Controls FLASH low power modes (control of LPM pin).</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>High power mode (LPM not used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Fast Standby mode. LPM deasserted for read operations, but asserted while FLASH IDLE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Low Power mode. LPM always asserted for reads. LPM_RD_WAIT must be programmed to accomodate longer read access times.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_RD_WAIT</name>
              <description>Sets FLASH waitstates when in LPM Mode 2 (RD_WAIT in LPM mode 2 only)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEDELAY</name>
              <description>Sets SE delay (FLASH address setup). A value of 5 is recommended.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RD_WAIT</name>
              <description>Sets read waitstates for normal (fast) operation. A value of 1 is recommended.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Cache Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000777</resetMask>

          <fields>
            <field>
              <name>FLASH1_SLM_ENABLE</name>
              <description>Enable FLASH Sleep Mode. Write to 1 to put FLASH1 into sleep mode. NOTE: there is a 5 us latency after waking FLASH until the first access will be returned.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_DISABLE</name>
              <description>Disable FLASH Sleep Mode. Write 1 to wake FLASH1 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_STATUS</name>
              <description>FLASH Sleep Mode Status. 1 indicates that FLASH1 is in sleep mode, 0 indicates FLASH1 is in normal mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_ENABLE</name>
              <description>Enable FLASH Sleep Mode. Write to 1 to put FLASH0 into sleep mode. NOTE: there is a 5 us latency after waking FLASH until the first access will be returned.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_DISABLE</name>
              <description>Disable FLASH Sleep Mode. Write 1 to wake FLASH0 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_STATUS</name>
              <description>FLASH Sleep Mode Status. 1 indicates that FLASH0 is in sleep mode, 0 indicates FLASH0 is in normal mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_READY</name>
              <description>Cache Ready Status (enabled and not processing an invalidate operation)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESET_STAT</name>
              <description>Reset Cache Statistics. When written to a 1, the cache monitor counters will be cleared. The monitor counters can be reset only when the CACHECFG.ENABLE_MONITOR bit is set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Cache Stats</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVALIDATE</name>
              <description>Writing a 1 to this bit field invalidates the FLASH cache contents.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR0START</name>
          <description>FLASH Cache Noncacheable Region 0 Start</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 0</description>
              <bitRange>[26:4]</bitRange>
              <access>read-write</access>

