pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>BURSTACK</name>
              <description>Frequency Burst Request Acknowledge. Frequency burst requested is always acknowledged whether burst is granted or not depending on feature enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTREQ</name>
              <description>Frequency Burst Enable Request</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Frequency for ARM core stays at 48MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Frequency for ARM core is increased to 96MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEBUCKTONADJ</name>
          <description>This is the register control for BLE ton adjustment logic.</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>

          <fields>
            <field>
              <name>ZEROLENDETECTEN</name>
              <description>BLEBUCK ZERO LENGTH DETECT ENABLE</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Zero Length Detect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Zero Length Detect</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROLENDETECTTRIM</name>
              <description>BLEBUCK ZERO LENGTH DETECT TRIM</description>
              <bitRange>[26:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SetF</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 81 us (10 percent margin of error) or more</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetE</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 75.6 us (10 percent margin of error) or more</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetD</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 70.2 us (10 percent margin of error) or more</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetC</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 64.8 us (10 percent margin of error) or more</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetB</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 59.4 us (10 percent margin of error) or more</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetA</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 54.0 us (10 percent margin of error) or more</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set9</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 48.6 us (10 percent margin of error) or more</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set8</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 43.2 us (10 percent margin of error) or more</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set7</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 37.8 us (10 percent margin of error) or more</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set6</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 32.4 us (10 percent margin of error) or more</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set5</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 27.0 us (10 percent margin of error) or more</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set4</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 21.6 us (10 percent margin of error) or more</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set3</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 16.2 us (10 percent margin of error) or more</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set2</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 10.8 us (10 percent margin of error) or more</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set1</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 5.4 us (10 percent margin of error) or more</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set0</name>
                  <description>Indicator send when the BLE BUCK asserts blebuck_comp1 for about 2.0 us (10 percent margin of error) or more</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TONADJUSTEN</name>
              <description>TON ADJUST ENABLE</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Adjust for BLE BUCK TON trim</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Adjust for BLE BUCK TON trim</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TONADJUSTPERIOD</name>
              <description>TON ADJUST PERIOD</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_3KHz</name>
                  <description>Adjust done for every 1 3KHz period</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12KHz</name>
                  <description>Adjust done for every 1 12KHz period</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_47KHz</name>
                  <description>Adjust done for every 1 47KHz period</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_94KHz</name>
                  <description>Adjust done for every 1 94KHz period</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TONHIGHTHRESHOLD</name>
              <description>TON ADJUST HIGH THRESHOLD. Suggested values are #15(94KHz) #2A(47Khz) #A6(12Khz) #29A(3Khz)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>

