pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>TONLOWTHRESHOLD</name>
              <description>TON ADJUST LOW THRESHOLD. Suggested values are #A(94KHz) #15(47KHz) #53(12Khz) #14D(3Khz)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CTIMER</name>
      <version>1.0</version>
      <description>Counter/Timer</description>
      <!-- <groupName>GROUP_CTIMER</groupName> -->
      <baseAddress>0x40008000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000310</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CTIMER</name>
        <value>14</value>
        <!--  <description>CTIMER IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER</name>
        <value>22</value>
        <!--  <description>STIMER IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR0</name>
        <value>23</value>
        <!--  <description>STIMER_CMPR0 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR1</name>
        <value>24</value>
        <!--  <description>STIMER_CMPR1 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR2</name>
        <value>25</value>
        <!--  <description>STIMER_CMPR2 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR3</name>
        <value>26</value>
        <!--  <description>STIMER_CMPR3 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR4</name>
        <value>27</value>
        <!--  <description>STIMER_CMPR4 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR5</name>
        <value>28</value>
        <!--  <description>STIMER_CMPR5 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR6</name>
        <value>29</value>
        <!--  <description>STIMER_CMPR6 IRQ</description>  -->
      </interrupt>      <interrupt>
        <name>STIMER_CMPR7</name>
        <value>30</value>
        <!--  <description>STIMER_CMPR7 IRQ</description>  -->
      </interrupt>
      <registers>
        <register>
          <name>TMR0</name>
          <description>This register holds the running time or event count for CTIMER 0. This is either for each 16 bit half or for the whole 32 bit count when the pair is linked. If the pair is not linked, they can be running on separate clocks and are completely independent.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTTMRB0</name>
              <description>Counter/Timer B0.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

