pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>TMRA3EN23</name>
              <description>Counter/Timer A3 Upper compare enable.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable enhanced functions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable enhanced functions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA3POL23</name>
              <description>Counter/Timer A3 Upper output polarity</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORM</name>
                  <description>Upper output normal polarity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Upper output inverted polarity.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA3TINV</name>
              <description>Counter/Timer A3 Invert on trigger.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable invert on trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable invert on trigger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA3NOSYNC</name>
              <description>Source clock synchronization control.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Synchronization on source clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSYNC</name>
                  <description>No synchronization on source clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA3TRIG</name>
              <description>Counter/Timer A3 Trigger Select.</description>
              <bitRange>[10:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Trigger source is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT</name>
                  <description>Trigger source is CTIMERB3 OUT.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Trigger source is CTIMERB2 OUT.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT</name>
                  <description>Trigger source is CTIMERA2 OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT</name>
                  <description>Trigger source is CTIMERA4 OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT</name>
                  <description>Trigger source is CTIMERB4 OUT.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Trigger source is CTIMERA7 OUT.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT</name>
                  <description>Trigger source is CTIMERB7 OUT.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT2</name>
                  <description>Trigger source is CTIMERB5 OUT2.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT2</name>
                  <description>Trigger source is CTIMERA5 OUT2.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT2</name>
                  <description>Trigger source is CTIMERA1 OUT2.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT2</name>
                  <description>Trigger source is CTIMERB1 OUT2.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2DUAL</name>
                  <description>Trigger source is CTIMERA6 OUT2, dual edge.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT2DUAL</name>
                  <description>Trigger source is CTIMERA7 OUT2, dual edge.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT2DUAL</name>
                  <description>Trigger source is CTIMERB2 OUT2, dual edge.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT2DUAL</name>
                  <description>Trigger source is CTIMERA2 OUT2, dual edge.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA3LMT</name>
              <description>Counter/Timer A3 Pattern Limit Count.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

