pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4K</name>
                  <description>Clock source is HFRC / 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>Clock source is the XT (uncalibrated).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>Clock source is XT / 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>Clock source is XT / 16</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV128</name>
                  <description>Clock source is XT / 128</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>Clock source is LFRC / 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>Clock source is LFRC / 32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1K</name>
                  <description>Clock source is LFRC / 1024</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>Clock source is LFRC</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_100HZ</name>
                  <description>Clock source is 100 Hz from the current RTC oscillator.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK_DIV4</name>
                  <description>Clock source is HCLK / 4. (note: this clock is only available when MCU is in active mode)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>Clock source is XT / 4</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>Clock source is XT / 8</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>Clock source is XT / 32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB4</name>
                  <description>Clock source is CTIMERB4 OUT.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA1</name>
                  <description>Clock source is CTIMERA1 OUT.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB1</name>
                  <description>Clock source is CTIMERB1 OUT.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA5</name>
                  <description>Clock source is CTIMERA5 OUT.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB5</name>
                  <description>Clock source is CTIMERB5 OUT.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB0</name>
                  <description>Clock source is CTIMERB0 OUT.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB2</name>
                  <description>Clock source is CTIMERB2 OUT.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB3</name>
                  <description>Clock source is CTIMERB3 OUT.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB6</name>
                  <description>Clock source is CTIMERB6 OUT.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKBLE</name>
                  <description>Clock source is BLE buck converter TON pulses.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKB</name>
                  <description>Clock source is Memory buck converter TON pulses.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKA</name>
                  <description>Clock source is CPU buck converter TON pulses.</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA4EN</name>
              <description>Counter/Timer A4 Enable bit.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter/Timer A4 Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter/Timer A4 Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPRAUXA4</name>
          <description>Enhanced compare limits for timer half A.</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR3A4</name>
              <description>Counter/Timer A4 Compare Register 3. Holds the upper limit for timer half A.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

