pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6</name>
          <description>Counter/Timer 6</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTTMRB6</name>
              <description>Counter/Timer B6.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTTMRA6</name>
              <description>Counter/Timer A6.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMPRA6</name>
          <description>This register holds the compare limits for timer half A.</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR1A6</name>
              <description>Counter/Timer A6 Compare Register 1.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMPR0A6</name>
              <description>Counter/Timer A6 Compare Register 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMPRB6</name>
          <description>This register holds the compare limits for timer half B.</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR1B6</name>
              <description>Counter/Timer B6 Compare Register 1.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMPR0B6</name>
              <description>Counter/Timer B6 Compare Register 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRL6</name>
          <description>This register holds the control bit fields for both halves of timer 6.</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFF1FFF</resetMask>

          <fields>
            <field>
              <name>CTLINK6</name>
              <description>Counter/Timer A6/B6 Link bit.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO_16BIT_TIMERS</name>
                  <description>Use A6/B6 timers as two independent 16-bit timers (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT_TIMER</name>
                  <description>Link A6/B6 timers into a single 32-bit timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6POL</name>
              <description>Counter/Timer B6 output polarity.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMRPINB6 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMRPINB6 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6CLR</name>
              <description>Counter/Timer B6 Clear bit.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow counter/timer B6 to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Holds counter/timer B6 at 0x0000.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6IE1</name>
              <description>Counter/Timer B6 Interrupt Enable bit for COMPR1.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer B6 from generating an interrupt based on COMPR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer B6 to generate an interrupt based on COMPR1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6IE0</name>
              <description>Counter/Timer B6 Interrupt Enable bit for COMPR0.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer B6 from generating an interrupt based on COMPR0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer B6 to generate an interrupt based on COMPR0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6FN</name>
              <description>Counter/Timer B6 Function Select.</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLECOUNT</name>
                  <description>Single count (output toggles and sticks). Count to CMPR0B6, stop.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATEDCOUNT</name>
                  <description>Repeated count (periodic 1-clock-cycle-wide pulses). Count to CMPR0B6, restart.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ONCE</name>
                  <description>Pulse once (aka one-shot). Count to CMPR0B6, assert, count to CMPR1B6, deassert, stop.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_CONT</name>
                  <description>Pulse continuously. Count to CMPR0B6, assert, count to CMPR1B6, deassert, restart.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPATTERN</name>
                  <description>Single pattern.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATPATTERN</name>
                  <description>Repeated pattern.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous run (aka Free Run). Count continuously.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTPWN</name>
                  <description>Alternate PWM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6CLK</name>
              <description>Counter/Timer B6 Clock Select.</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRPIN</name>
                  <description>Clock source is TMRPINB.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Clock source is the HFRC / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Clock source is HFRC / 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>Clock source is HFRC / 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV1024</name>
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4K</name>
                  <description>Clock source is HFRC / 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>Clock source is the XT (uncalibrated).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>Clock source is XT / 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>Clock source is XT / 16</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV128</name>
                  <description>Clock source is XT / 128</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>Clock source is LFRC / 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>Clock source is LFRC / 32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1K</name>
                  <description>Clock source is LFRC / 1024</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>Clock source is LFRC</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_100HZ</name>
                  <description>Clock source is 100 Hz from the current RTC oscillator.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK_DIV4</name>
                  <description>Clock source is HCLK / 4 (note: this clock is only available when MCU is in active mode)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>Clock source is XT / 4</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>Clock source is XT / 8</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>Clock source is XT / 32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA6</name>
                  <description>Clock source is CTIMERA6 OUT.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA3</name>
                  <description>Clock source is CTIMERA3 OUT.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB3</name>
                  <description>Clock source is CTIMERB3 OUT.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA7</name>
                  <description>Clock source is CTIMERA7 OUT.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB7</name>
                  <description>Clock source is CTIMERB7 OUT.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB0</name>
                  <description>Clock source is CTIMERB0 OUT.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB1</name>
                  <description>Clock source is CTIMERB1 OUT.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB2</name>
                  <description>Clock source is CTIMERB2 OUT.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB4</name>
                  <description>Clock source is CTIMERB4 OUT.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKBLE</name>
                  <description>Clock source is BLE buck converter TON pulses.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKB</name>
                  <description>Clock source is Memory buck converter TON pulses.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKA</name>
                  <description>Clock source is CPU buck converter TON pulses.</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB6EN</name>
              <description>Counter/Timer B6 Enable bit.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter/Timer B6 Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter/Timer B6 Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6POL</name>
              <description>Counter/Timer A6 output polarity.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMRPINA6 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMRPINA6 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6CLR</name>
              <description>Counter/Timer A6 Clear bit.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow counter/timer A6 to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Holds counter/timer A6 at 0x0000.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6IE1</name>
              <description>Counter/Timer A6 Interrupt Enable bit based on COMPR1.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer A6 from generating an interrupt based on COMPR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer A6 to generate an interrupt based on COMPR1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6IE0</name>
              <description>Counter/Timer A6 Interrupt Enable bit based on COMPR0.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer A6 from generating an interrupt based on COMPR0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer A6 to generate an interrupt based on COMPR0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6FN</name>
              <description>Counter/Timer A6 Function Select.</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLECOUNT</name>
                  <description>Single count (output toggles and sticks). Count to CMPR0A6, stop.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATEDCOUNT</name>
                  <description>Repeated count (periodic 1-clock-cycle-wide pulses). Count to CMPR0A6, restart.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ONCE</name>
                  <description>Pulse once (aka one-shot). Count to CMPR0A6, assert, count to CMPR1A6, deassert, stop.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_CONT</name>
                  <description>Pulse continuously. Count to CMPR0A6, assert, count to CMPR1A6, deassert, restart.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPATTERN</name>
                  <description>Single pattern.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATPATTERN</name>
                  <description>Repeated pattern.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous run (aka Free Run). Count continuously.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTPWN</name>
                  <description>Alternate PWM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA6CLK</name>
              <description>Counter/Timer A6 Clock Select.</description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRPIN</name>
                  <description>Clock source is TMRPINA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Clock source is the HFRC / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Clock source is HFRC / 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>Clock source is HFRC / 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV1024</name>
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
