pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>CFG19</name>
              <description>Pad output 19 configuration</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT2</name>
                  <description>Output is B1OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT</name>
                  <description>Output is B4OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT</name>
                  <description>Output is A2OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT2</name>
                  <description>Output is B4OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG18</name>
              <description>Pad output 18 configuration</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT2</name>
                  <description>Output is A3OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0OUT</name>
                  <description>Output is A0OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0OUT</name>
                  <description>Output is B0OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT</name>
                  <description>Output is B4OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG17</name>
              <description>Pad output 17 configuration</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT2</name>
                  <description>Output is A1OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT</name>
                  <description>Output is A4OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT</name>
                  <description>Output is B7OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT2</name>
                  <description>Output is A4OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG16</name>
              <description>Pad output 16 configuration</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT2</name>
                  <description>Output is B3OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0OUT2</name>
                  <description>Output is A0OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0OUT</name>
                  <description>Output is A0OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT</name>
                  <description>Output is A4OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG15</name>
              <description>Pad output 15 configuration</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT2</name>
                  <description>Output is A4OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Output is A7OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT</name>
                  <description>Output is B3OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT2</name>
                  <description>Output is B3OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG14</name>
              <description>Pad output 14 configuration</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Output is A7OUT.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT2</name>
                  <description>Output is B7OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT</name>
                  <description>Output is B1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT</name>
                  <description>Output is B3OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG13</name>
              <description>Pad output 13 configuration</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT2</name>
                  <description>Output is B4OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT</name>
                  <description>Output is A3OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT2</name>
                  <description>Output is A3OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG12</name>
              <description>Pad output 12 configuration</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B6OUT2</name>
                  <description>Output is B6OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0OUT2</name>
                  <description>Output is B0OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT</name>
                  <description>Output is B1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT</name>
                  <description>Output is A3OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG11</name>
              <description>Pad output 11 configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT2</name>
                  <description>Output is B5OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT</name>
                  <description>Output is B4OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Output is B2OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT2</name>
                  <description>Output is B2OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG10</name>
              <description>Pad output 10 configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT2</name>
                  <description>Output is B4OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT2</name>
                  <description>Output is B3OUT2.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Output is B2OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCFG2</name>
          <description>Pad output configuration 2.</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x24922292</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>

