pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>CFG29</name>
              <description>Pad output 29 configuration</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT2</name>
                  <description>Output is A3OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Output is A7OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT2</name>
                  <description>Output is B5OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG28</name>
              <description>Pad output 28 configuration</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0OUT2</name>
                  <description>Output is B0OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT2</name>
                  <description>Output is A5OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3OUT</name>
                  <description>Output is A3OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Output is A7OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG27</name>
              <description>Pad output 27 configuration</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT2</name>
                  <description>Output is B2OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B6OUT</name>
                  <description>Output is B6OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B6OUT2</name>
                  <description>Output is B6OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG26</name>
              <description>Pad output 26 configuration</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT2</name>
                  <description>Output is A1OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT</name>
                  <description>Output is A5OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Output is B2OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B6OUT</name>
                  <description>Output is B6OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG25</name>
              <description>Pad output 25 configuration</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT2</name>
                  <description>Output is A2OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT</name>
                  <description>Output is B2OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B4OUT2</name>
                  <description>Output is B4OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG24</name>
              <description>Pad output 24 configuration</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1OUT2</name>
                  <description>Output is B1OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT</name>
                  <description>Output is A2OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG23</name>
              <description>Pad output 23 configuration</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0OUT2</name>
                  <description>Output is B0OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT</name>
                  <description>Output is A5OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A7OUT</name>
                  <description>Output is A7OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT2</name>
                  <description>Output is B5OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG22</name>
              <description>Pad output 22 configuration</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2OUT2</name>
                  <description>Output is A2OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT</name>
                  <description>Output is B5OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG21</name>
              <description>Pad output 21 configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0OUT2</name>
                  <description>Output is A0OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B5OUT</name>
                  <description>Output is B5OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT2</name>
                  <description>Output is A5OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG20</name>
              <description>Pad output 20 configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2OUT2</name>
                  <description>Output is B2OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT2</name>
                  <description>Output is A1OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1OUT</name>
                  <description>Output is A1OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5OUT</name>
                  <description>Output is A5OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCFG3</name>
          <description>Pad output configuration 3.</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000012</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>CFG31</name>
              <description>Pad output 31 configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT2</name>
                  <description>Output is B3OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT</name>
                  <description>Output is B7OUT.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT</name>
                  <description>Output is A6OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT2</name>
                  <description>Output is B7OUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG30</name>
              <description>Pad output 30 configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A7OUT2</name>
                  <description>Output is A7OUT2.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A6OUT2</name>
                  <description>Output is A6OUT2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0OUT2</name>
                  <description>Output is A0OUT2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4OUT2</name>
                  <description>Output is A4OUT2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3OUT</name>
                  <description>Output is B3OUT.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B7OUT</name>
                  <description>Output is B7OUT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Force output to 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Force output to 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INCFG</name>
          <description>Pad input configuration.</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

