pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>CTMRB4C0INT</name>
              <description>Counter/Timer B4 interrupt based on COMPR0.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA4C0INT</name>
              <description>Counter/Timer A4 interrupt based on COMPR0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C0INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C0INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C0INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C0INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C0INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR0.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C0INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C0INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C0INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTMRB7C1INT</name>
              <description>Counter/Timer B7 interrupt based on COMPR1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA7C1INT</name>
              <description>Counter/Timer A7 interrupt based on COMPR1.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB6C1INT</name>
              <description>Counter/Timer B6 interrupt based on COMPR1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA6C1INT</name>
              <description>Counter/Timer A6 interrupt based on COMPR1.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB5C1INT</name>
              <description>Counter/Timer B5 interrupt based on COMPR1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA5C1INT</name>
              <description>Counter/Timer A5 interrupt based on COMPR1.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB4C1INT</name>
              <description>Counter/Timer B4 interrupt based on COMPR1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA4C1INT</name>
              <description>Counter/Timer A4 interrupt based on COMPR1.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C1INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR1.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C1INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR1.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C1INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C1INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR1.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C1INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

