pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>PAD19FNCSEL</name>
              <description>Pad 19 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPRF0</name>
                  <description>Configure as the analog comparator reference 0 signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE19</name>
                  <description>IOM/MSPI nCE group 19</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT6</name>
                  <description>CTIMER conenction 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO19</name>
                  <description>Configure as GPIO19</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCLK</name>
                  <description>SCARD serial clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANATEST1</name>
                  <description>Configure as the ANATEST1 I/O signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX input signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SBCLK</name>
                  <description>Configure as the PDM I2S bit clock input signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD19STRNG</name>
              <description>Pad 19 drive strength</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD19INPEN</name>
              <description>Pad 19 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD19PULL</name>
              <description>Pad 19 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD18FNCSEL</name>
              <description>Pad 18 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPIN1</name>
                  <description>Configure as the analog comparator input 1 signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE18</name>
                  <description>IOM/MSPI nCE group 18</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT4</name>
                  <description>CTIMER connection 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO18</name>
                  <description>Configure as GPIO18</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as UART0 RTS output signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANATEST2</name>
                  <description>Configure as ANATEST2 I/O signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as UART1 TX output signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCIO</name>
                  <description>SCARD data input/output connection</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD18STRNG</name>
              <description>Pad 18 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD18INPEN</name>
              <description>Pad 18 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD18PULL</name>
              <description>Pad 18 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD17FNCSEL</name>
              <description>Pad 17 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPRF1</name>
                  <description>Configure as the analog comparator reference signal 1 input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE17</name>
                  <description>IOM/MSPI nCE group 17</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1</name>
                  <description>Configure as the ADC Trigger 1 signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO17</name>
                  <description>Configure as GPIO17</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCCLK</name>
                  <description>SCARD serial clock output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as UART0 RX input signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1CTS</name>
                  <description>Configure as UART1 CTS input signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD17STRNG</name>
              <description>Pad 17 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD17INPEN</name>
              <description>Pad 17 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD17PULL</name>
              <description>Pad 17 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD16FNCSEL</name>
              <description>Pad 16 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSE0</name>
                  <description>Configure as the analog ADC single ended port 0 input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE16</name>
                  <description>IOM/MSPI nCE group 16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0</name>
                  <description>Configure as the ADC Trigger 0 signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO16</name>
                  <description>Configure as GPIO16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCRST</name>
                  <description>SCARD reset output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPIN0</name>
                  <description>Configure as comparator input 0 signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as UART0 TX output signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1RTS</name>
                  <description>Configure as UART1 RTS output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD16STRNG</name>
              <description>Pad 16 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD16INPEN</name>
              <description>Pad 16 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD16PULL</name>
              <description>Pad 16 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGF</name>
          <description>This register controls the pad configuration controls for PAD23 through PAD20. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18180202</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>

