pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>PAD47FNCSEL</name>
              <description>Pad 47 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32kHzXT</name>
                  <description>Configure as the 32kHz output clock from the crystal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE47</name>
                  <description>IOM/MSPI nCE group 47</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT26</name>
                  <description>CTIMER connection 26</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO47</name>
                  <description>Configure as GPIO47</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5MOSI</name>
                  <description>Configure as the IOMSTR5 SPI MOSI output signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX input signal</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47STRNG</name>
              <description>Pad 47 drive strength</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47INPEN</name>
              <description>Pad 47 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD47PULL</name>
              <description>Pad 47 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46FNCSEL</name>
              <description>Pad 46 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32khz_XT</name>
                  <description>Configure as the 32kHz output clock from the crystal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE46</name>
                  <description>IOM/MSPI nCE group 46</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT24</name>
                  <description>CTIMER connection 24</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO46</name>
                  <description>Configure as GPIO46</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCCRST</name>
                  <description>SCARD reset output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMCLK</name>
                  <description>PDM serial clock output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX output signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial wire debug SWO signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46STRNG</name>
              <description>Pad 46 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46INPEN</name>
              <description>Pad 46 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD46PULL</name>
              <description>Pad 46 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45FNCSEL</name>
              <description>Pad 45 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UA1CTS</name>
                  <description>Configure as the UART1 CTS input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE45</name>
                  <description>IOM/MSPI nCE group 45</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT22</name>
                  <description>CTIMER connection 22</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO45</name>
                  <description>Configure as GPIO45</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SDAT</name>
                  <description>I2S serial data output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMDATA</name>
                  <description>PDM serial data input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as the SPI channel 5 nCE signal from IOMSTR5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial wire debug SWO signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45STRNG</name>
              <description>Pad 45 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45INPEN</name>
              <description>Pad 45 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD45PULL</name>
              <description>Pad 45 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44FNCSEL</name>
              <description>Pad 44 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UA1RTS</name>
                  <description>Configure as the UART1 RTS output signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE44</name>
                  <description>IOM/MSPI nCE group 44</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT20</name>
                  <description>CTIMER connection 20</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO44</name>
                  <description>Configure as GPIO44</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4MOSI</name>
                  <description>Configure as the IOMSTR4 SPI MOSI signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as the UART0 TX output signal</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44STRNG</name>
              <description>Pad 44 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44INPEN</name>
              <description>Pad 44 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD44PULL</name>
              <description>Pad 44 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGM</name>
          <description>This register controls the pad configuration controls for PAD49 through PAD48. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001818</resetValue>
          <resetMask>0x0000FFFF</resetMask>

