pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>PAD49RSEL</name>
              <description>Pad 49 pullup resistor selection.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD49FNCSEL</name>
              <description>Pad 49 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as the UART0 RX input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE49</name>
                  <description>IOM/MSPPI nCE group 49</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT30</name>
                  <description>CTIMER connection 30</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO49</name>
                  <description>Configure as GPIO49</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5SDAWIR3</name>
                  <description>Configure as the IOMSTR5 I2C SDA or SPI WIR3 signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5MISO</name>
                  <description>Configure as the IOMSTR5 SPI MISO input signal</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD49STRNG</name>
              <description>Pad 49 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD49INPEN</name>
              <description>Pad 49 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD49PULL</name>
              <description>Pad 49 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD48RSEL</name>
              <description>Pad 48 pullup resistor selection.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULL1_5K</name>
                  <description>Pullup is ~1.5 KOhms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL6K</name>
                  <description>Pullup is ~6 KOhms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL12K</name>
                  <description>Pullup is ~12 KOhms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULL24K</name>
                  <description>Pullup is ~24 KOhms</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD48FNCSEL</name>
              <description>Pad 48 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as the UART0 TX output signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE48</name>
                  <description>IOM/MSPI nCE group 48</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT28</name>
                  <description>CTIMER connection 28</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO48</name>
                  <description>Configure as GPIO48</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5SCL</name>
                  <description>Configure as the IOMSTR5 I2C SCL clock I/O signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M5SCK</name>
                  <description>Configure as the IOMSTR5 SPI SCK output</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD48STRNG</name>
              <description>Pad 48 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD48INPEN</name>
              <description>Pad 48 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD48PULL</name>
              <description>Pad 48 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGA</name>
          <description>GPIO configuration controls for GPIO[7:0]. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

