pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>GPIO7INTD</name>
              <description>GPIO7 interrupt direction, nCE polarity.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x0 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x0 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO7OUTCFG</name>
              <description>GPIO7 output configuration.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO7INCFG</name>
              <description>GPIO7 input enable.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO6INTD</name>
              <description>GPIO6 interrupt direction.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDIS</name>
                  <description>INCFG = 1 - No interrupt on GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTBOTH</name>
                  <description>INCFG = 1 - Interrupt on either low to high or high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO6OUTCFG</name>
              <description>GPIO6 output configuration.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO6INCFG</name>
              <description>GPIO6 input enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO5INTD</name>
              <description>GPIO5 interrupt direction.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDIS</name>
                  <description>INCFG = 1 - No interrupt on GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTBOTH</name>
                  <description>INCFG = 1 - Interrupt on either low to high or high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO5OUTCFG</name>
              <description>GPIO5 output configuration.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO5INCFG</name>
              <description>GPIO5 input enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO4INTD</name>
              <description>GPIO4 interrupt direction.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x2 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x2 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO4OUTCFG</name>
              <description>GPIO4 output configuration.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO4INCFG</name>
              <description>GPIO4 input enable.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3INTD</name>
              <description>GPIO3 interrupt direction.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x2 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x2 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3OUTCFG</name>
              <description>GPIO3 output configuration.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3INCFG</name>
              <description>GPIO3 input enable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2INTD</name>
              <description>GPIO2 interrupt direction.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x7 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x7 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2OUTCFG</name>
              <description>GPIO2 output configuration.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2INCFG</name>
              <description>GPIO2 input enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1INTD</name>
              <description>GPIO1 interrupt direction.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x7 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x7 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1OUTCFG</name>
              <description>GPIO1 output configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1INCFG</name>
              <description>GPIO1 input enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0INTD</name>
              <description>GPIO0 interrupt direction.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x7 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x7 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0OUTCFG</name>
              <description>GPIO0 output configuration.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0INCFG</name>
              <description>GPIO0 input enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGB</name>
          <description>GPIO configuration controls for GPIO[15:8]. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

