pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>GPIO47INTD</name>
              <description>GPIO47 interrupt direction.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO47OUTCFG</name>
              <description>GPIO47 output configuration.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO47INCFG</name>
              <description>GPIO47 input enable.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO46INTD</name>
              <description>GPIO46 interrupt direction.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO46OUTCFG</name>
              <description>GPIO46 output configuration.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO46INCFG</name>
              <description>GPIO46 input enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO45INTD</name>
              <description>GPIO45 interrupt direction.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO45OUTCFG</name>
              <description>GPIO45 output configuration.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO45INCFG</name>
              <description>GPIO45 input enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO44INTD</name>
              <description>GPIO44 interrupt direction.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO44OUTCFG</name>
              <description>GPIO44 output configuration.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO44INCFG</name>
              <description>GPIO44 input enable.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO43INTD</name>
              <description>GPIO43 interrupt direction.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO43OUTCFG</name>
              <description>GPIO43 output configuration.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO43INCFG</name>
              <description>GPIO43 input enable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO42INTD</name>
              <description>GPIO42 interrupt direction.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x1 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x1 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO42OUTCFG</name>
              <description>GPIO42 output configuration.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO42INCFG</name>
              <description>GPIO42 input enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO41INTD</name>
              <description>GPIO41 interrupt direction.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>FNCSEL = 0x0 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>FNCSEL = 0x0 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO41OUTCFG</name>
              <description>GPIO41 output configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO41INCFG</name>
              <description>GPIO41 input enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO40INTD</name>
              <description>GPIO40 interrupt direction.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDIS</name>
                  <description>INCFG = 1 - No interrupt on GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTBOTH</name>
                  <description>INCFG = 1 - Interrupt on either low to high or high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO40OUTCFG</name>
              <description>GPIO40 output configuration.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FNCSEL = 0x3 - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>FNCSEL = 0x3 - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>FNCSEL = 0x3 - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>FNCSEL = 0x3 - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO40INCFG</name>
              <description>GPIO40 input enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGG</name>
          <description>GPIO configuration controls for GPIO[49:48]. Writes to this register must be unlocked by the PADKEY register.</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

