pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RDB</name>
          <description>GPIO Input Register B (49-32)</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>RDB</name>
              <description>GPIO49-32 read data.</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTA</name>
          <description>GPIO Output Register A (31-0)</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTA</name>
              <description>GPIO31-0 write data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTB</name>
          <description>GPIO Output Register B (49-32)</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>WTB</name>
              <description>GPIO49-32 write data.</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTSA</name>
          <description>GPIO Output Register A Set (31-0)</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTSA</name>
              <description>Set the GPIO31-0 write data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTSB</name>
          <description>GPIO Output Register B Set (49-32)</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>WTSB</name>
              <description>Set the GPIO49-32 write data.</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTCA</name>
          <description>GPIO Output Register A Clear (31-0)</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTCA</name>
              <description>Clear the GPIO31-0 write data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WTCB</name>
          <description>GPIO Output Register B Clear (49-32)</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>WTCB</name>
              <description>Clear the GPIO49-32 write data.</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENA</name>
          <description>GPIO Enable Register A (31-0)</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENA</name>
              <description>GPIO31-0 output enables</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENB</name>
          <description>GPIO Enable Register B (49-32)</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>ENB</name>
              <description>GPIO49-32 output enables</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENSA</name>
          <description>GPIO Enable Register A Set (31-0)</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENSA</name>
              <description>Set the GPIO31-0 output enables</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

