pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOM0IRQ</name>
          <description>IOMSTR0 IRQ select for flow control.</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM0IRQ</name>
              <description>IOMSTR0 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM1IRQ</name>
          <description>IOMSTR1 IRQ select for flow control.</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM1IRQ</name>
              <description>IOMSTR1 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM2IRQ</name>
          <description>IOMSTR2 IRQ select for flow control.</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM2IRQ</name>
              <description>IOMSTR2 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM3IRQ</name>
          <description>IOMSTR3 IRQ select for flow control.</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM3IRQ</name>
              <description>IOMSTR3 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM4IRQ</name>
          <description>IOMSTR4 IRQ select for flow control.</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM4IRQ</name>
              <description>IOMSTR4 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM5IRQ</name>
          <description>IOMSTR5 IRQ select for flow control.</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>IOM5IRQ</name>
              <description>IOMSTR5 IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLEIFIRQ</name>
          <description>BLE IF IRQ select for flow control.</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>BLEIFIRQ</name>
              <description>BLEIF IRQ pad select.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GPIOOBS</name>
          <description>GPIO Observation mode sample register</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OBS_DATA</name>
              <description>Sample of the data output on the GPIO observation port. May have async sampling issues, as the data is not synronized to the read operation. Intended for debug purposes only</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGA</name>
          <description>This register has additional configuration control for pads 3, 2, 1, 0</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD3_SR</name>
              <description>Pad 3 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD3_DS1</name>
              <description>Pad 3 high order drive strength selection. Used in conjunction with PAD3STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

