pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGC</name>
          <description>This register has additional configuration control for pads 11, 10, 9, 8</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD11_SR</name>
              <description>Pad 11 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD11_DS1</name>
              <description>Pad 11 high order drive strength selection. Used in conjunction with PAD11STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD10_SR</name>
              <description>Pad 10 slew rate selection.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD10_DS1</name>
              <description>Pad 10 high order drive strength selection. Used in conjunction with PAD10STRNG field to set the pad drive strength.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD9_SR</name>
              <description>Pad 9 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD9_DS1</name>
              <description>Pad 9 high order drive strength selection. Used in conjunction with PAD9STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD8_SR</name>
              <description>Pad 8 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD8_DS1</name>
              <description>Pad 8 high order drive strength selection. Used in conjunction with PAD8STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGD</name>
          <description>This register has additional configuration control for pads 15, 14, 13, 12</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD15_SR</name>
              <description>Pad 15 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15_DS1</name>
              <description>Pad 15 high order drive strength selection. Used in conjunction with PAD15STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD14_SR</name>
              <description>Pad 14 slew rate selection.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14_DS1</name>
              <description>Pad 14 high order drive strength selection. Used in conjunction with PAD14STRNG field to set the pad drive strength.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD13_SR</name>
              <description>Pad 13 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13_DS1</name>
              <description>Pad 13 high order drive strength selection. Used in conjunction with PAD13STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

