pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>GPIO48</name>
              <description>GPIO48 interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO47</name>
              <description>GPIO47 interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO46</name>
              <description>GPIO46 interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO45</name>
              <description>GPIO45 interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO44</name>
              <description>GPIO44 interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO43</name>
              <description>GPIO43 interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO42</name>
              <description>GPIO42 interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO41</name>
              <description>GPIO41 interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO40</name>
              <description>GPIO40 interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO39</name>
              <description>GPIO39 interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO38</name>
              <description>GPIO38 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO37</name>
              <description>GPIO37 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO36</name>
              <description>GPIO36 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO35</name>
              <description>GPIO35 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO34</name>
              <description>GPIO34 interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO33</name>
              <description>GPIO33 interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO32</name>
              <description>GPIO32 interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>IOM0</name>
      <version>1.0</version>
      <description>IO Peripheral Master</description>
      <!-- <groupName>GROUP_IOM</groupName> -->
      <baseAddress>0x50004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000414</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOMSTR0</name>
        <value>6</value>
        <!--  <description>IOMSTR0 IRQ</description>  -->
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>Provides direct random access to both output and input FIFOs. The state of the FIFO is not disturbed by reading these locations (i.e., no POP will be done). FIFO0 is accessible from addresses 0x0 - 0x1C, and is used for data output from the IOM to external devices. These FIFO locations can be read and written directly.
FIFO1 locations 0x20 - 0x3C provide read only access to the input FIFO. These FIFO locations cannot be directly written by the MCU and are updated only by the internal hardware. Writes to FIFO0 will take effect immediately. The FIFO pointers
in register FIFOLOC indicate the current offset into each FIFO for the read and write operations.
Access to the FIFOs can only be done in word increments; byte reads and writes are not supported.
Push and pop style access to FIFO0 can be accomplished using the FIFOPOP and FIFOPUSH registers below.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO direct access. Only locations 0 - 3F will return valid information.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPTR</name>
          <description>Provides the current valid byte count of data within the FIFO as seen from the internal state machines. FIFO0 is dedicated to outgoing transactions and FIFO1 is dedicated to incoming transactions. All counts are specified in units of bytes.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO1REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

