pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>SMOD0TYPE</name>
              <description>Submodule 0 module type. This is the SPI Master interface.</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_MASTER</name>
                  <description>MSPI submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MASTER</name>
                  <description>I2C Master submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPI</name>
                  <description>SPI Slave submodule</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SI2C</name>
                  <description>I2C Slave submodule</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD0EN</name>
              <description>Submodule 0 enable (1) or disable (0)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Writes to this register will start an IO transaction, as well as set various parameters for the command itself. Reads will return the command value written to the CMD register.
To read the number of bytes that have yet to be transferred, refer to the CTSIZE field within the CMDSTAT register.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF3FFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETLO</name>
              <description>This register holds the low order byte of offset to be used in the transaction. The number of offset bytes to use is set with bits 1:0 of the command.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSEL</name>
              <description>Command Specific selection information. Not used in Master I2C. Used as CEn select for Master SPI transactions</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSIZE</name>
              <description>Defines the transaction size in bytes. The offset transfer is not included in this size.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Continue to hold the bus after the current transaction if set to a 1 with a new command issued.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OFFSETCNT</name>
              <description>Number of offset bytes to use for the command - 0, 1, 2, 3 are valid selections. The second (byte 1) and third byte (byte 2) are read from the OFFSETHI register, and the low order byte is pulled from this register in the OFFSETLO field.
Offset bytes are transmitted highest byte first. EG if OFFSETCNT == 3, OFFSETHI[15:8] will be transmitted first, then OFFSETHI[7:0] then OFFSETLO.
If OFFSETCNT == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.
If OFFSETCNT == 1, only OFFSETLO will be transmitted.
Offset bytes are always transmitted MSB first, regardless of the value of the LSB control bit within the module configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMW</name>
                  <description>SPI only. Test mode to do constant write operations. Useful for debug and power measurements. Will continually send data in OFFSET field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR</name>
                  <description>SPI Only. Test mode to do constant read operations. Useful for debug and power measurements. Will continually read data from external input</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCX</name>
          <description>Enables use of CE signals to transmit DCX level for SPI transactions. Only used in Apollo3 Revision B. For Revision A, this register MUST NOT be programmed!</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DCXEN</name>
              <description>Revision A: MUST NOT be programmed!  Revision B: Bit 4: DCX Signaling Enable via other CE signals. The selected DCX signal (unused CE pin) will be driven low during write of offset byte, and high during transmission of data bytes.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DCX.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DCX.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CE3OUT</name>
              <description>Revision A: MUST NOT be programmed!  Revision B: Enable DCX output for CE3 output.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

