pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>CE2OUT</name>
              <description>Revision A: MUST NOT be programmed!  Revision B: Enable DCX output for CE2 output.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CE1OUT</name>
              <description>Revision A: MUST NOT be programmed!  Revision B: Enable DCX output for CE1 output.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CE0OUT</name>
              <description>Revision A: MUST NOT be programmed!  Revision B: Enable DCX output for CE0 output.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETHI</name>
          <description>High order 2 bytes of 3 byte offset for IO transaction</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETHI</name>
              <description>Holds the high order 2 bytes of the 3 byte addressing/offset field to use with IO commands. The number of offset bytes to use is specified in the command register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTAT</name>
          <description>Provides status on the execution of the command currently in progress. The fields in this register will reflect the real time status of the internal state machines and data transfers within the IOM.
These are read only fields and writes to the registers are ignored.</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>CTSIZE</name>
              <description>The current number of bytes still to be transferred with this command. This field will count down to zero.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSTAT</name>
              <description>The current status of the command execution.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error encountered with command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Actively processing command</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, no active command, no error</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Command in progress, but waiting on data from host</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCMD</name>
              <description>current command that is being executed</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGEN</name>
          <description>Provides control on which event will trigger the DMA transfer after the DMA operation is setup and enabled. The trigger event will cause a number of bytes (depending on trigger event) to be
transferred via the DMA operation, and can be used to adjust the latency of data to/from the IOM module to/from the DMA target. DMA transfers are broken into smaller transfers internally of up to
16 bytes each, and multiple trigger events can be used to complete the entire programmed DMA transfer.</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DTHREN</name>
              <description>Trigger DMA upon THR level reached. For M2P DMA operations (IOM writes), the trigger will assert when the write FIFO has (WTHR/4) number of words free in the write FIFO, and will transfer (WTHR/4) number of words
or, if the number of words left to transfer is less than the WTHR value, will transfer the remaining byte count.
For P2M DMA operations, the trigger will assert when the read FIFO has (RTHR/4) words available in the read FIFO, and will transfer (RTHR/4) words to SRAM. This trigger will NOT assert when the transaction
completes and there are less than RTHR bytes left in the FIFO, since the RTHR has not been reached. In this case, the CMDCMP trigger must also be enabled to transfer the remaining read FIFO data to SRAM.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMDCMPEN</name>
              <description>Trigger DMA upon command complete. Enables the trigger of the DMA when a command is completed. When this event is triggered, the number of words transferred will be the lesser of the remaining TOTCOUNT bytes, or</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

