pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOINTCTL</name>
          <description>I/O Interrupt Control</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF01FFFF</resetMask>

          <fields>
            <field>
              <name>IOINTSET</name>
              <description>These bits set the IOINT interrupts when written with a 1.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTCLR</name>
              <description>This bit clears all of the IOINT interrupts when written with a 1.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINT</name>
              <description>These bits read the IOINT interrupts.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTEN</name>
              <description>These read-only bits indicate whether the IOINT interrupts are enabled.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GENADD</name>
          <description>General Address Data</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>GADATA</name>
              <description>The data supplied on the last General Address reference.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>XCMPWR</name>
              <description>Transfer complete interrupt, write to register space.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XCMPWF</name>
              <description>Transfer complete interrupt, write to FIFO space.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XCMPRR</name>
              <description>Transfer complete interrupt, read from register space.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XCMPRF</name>
              <description>Transfer complete interrupt, read from FIFO space.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTW</name>
              <description>IO Write interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GENAD</name>
              <description>I2C General Address interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRDERR</name>
              <description>FIFO Read Error interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>FIFO Underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>FIFO Overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSIZE</name>
              <description>FIFO Size interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>XCMPWR</name>
              <description>Transfer complete interrupt, write to register space.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XCMPWF</name>
              <description>Transfer complete interrupt, write to FIFO space.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XCMPRR</name>
              <description>Transfer complete interrupt, read from register space.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

