pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>BLEREQ</name>
              <description>Controls the BLE functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the BLE functionality</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the BLE functionality</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGGER</name>
          <description>Debugger Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LOCKOUT</name>
              <description>Lockout of debugger (SWD).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BODCTRL</name>
          <description>BOD control Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>BODHVREFSEL</name>
              <description>BODH External Reference Select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODLVREFSEL</name>
              <description>BODL External Reference Select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODFPWD</name>
              <description>BODF Power Down.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODCPWD</name>
              <description>BODC Power Down.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHPWD</name>
              <description>BODH Power Down.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODLPWD</name>
              <description>BODL Power Down.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCPWRDLY</name>
          <description>ADC Power Up Delay Control</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>ADCPWR1</name>
              <description>ADC Reference Keeper enable delay in 16 ADC CLK increments for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCPWR0</name>
              <description>ADC Reference Buffer Power Enable delay in 64 ADC CLK increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCCAL</name>
          <description>ADC Calibration Control</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>ADCCALIBRATED</name>
              <description>Status for ADC Calibration</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>ADC is not calibrated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>ADC is calibrated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALONPWRUP</name>
              <description>Run ADC Calibration on initial power up sequence</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable automatic calibration on initial power up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable automatic calibration on initial power up</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBATTLOAD</name>
          <description>ADC Battery Load Enable</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BATTLOAD</name>
              <description>Enable the ADC battery load resistor</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Battery load is disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Battery load is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIM</name>
          <description>ADC Trims</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x00001FC3</resetMask>

          <fields>
            <field>
              <name>ADCRFBUFIBTRIM</name>
              <description>ADC reference buffer input bias trim</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>

