pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DBGR2</name>
          <description>Read-only debug register 2</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC001C0DE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COOLCODE</name>
              <description>Read-only register for communication validation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PMUENABLE</name>
          <description>Control bit to enable/disable the PMU</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>PMU Enable Control bit. When set, the MCU's PMU will place the MCU into the lowest power consuming Deep Sleep mode upon execution of a WFI instruction (dependent on the setting of the SLEEPDEEP bit in the ARM SCR register). When cleared, regardless of the requested sleep mode, the PMU will not enter the lowest power Deep Sleep mode, instead entering the Sleep mode.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCU power management.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCU power management.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPIUCTRL</name>
          <description>TPIU Control Register. Determines the clock enable and frequency for the M4's TPIU interface.</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000701</resetMask>

          <fields>
            <field>
              <name>CLKSEL</name>
              <description>This field selects the frequency of the ARM M4 TPIU port.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWPWR</name>
                  <description>Low power state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV2</name>
                  <description>Selects HFRC divided by 2 as the source TPIU clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV8</name>
                  <description>Selects HFRC divided by 8 as the source TPIU clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV16</name>
                  <description>Selects HFRC divided by 16 as the source TPIU clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV32</name>
                  <description>Selects HFRC divided by 32 as the source TPIU clock</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>TPIU Enable field. When set, the ARM M4 TPIU is enabled and data can be streamed out of the MCU's SWO port using the ARM ITM and TPIU modules.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the TPIU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the TPIU.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTAPOINTER</name>
          <description>OTA (Over the Air) Update Pointer/Status. Reset only by POA</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OTAPOINTER</name>
              <description>Flash page pointer with updated OTA image</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OTASBLUPDATE</name>
              <description>Indicates that the sbl_init has been updated</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OTAVALID</name>
              <description>Indicates that an OTA update is valid</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>APBDMACTRL</name>
          <description>DMA Control Register. Determines misc settings for DMA operation</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000203</resetValue>
          <resetMask>0x0000FF03</resetMask>

          <fields>
            <field>
              <name>HYSTERESIS</name>
              <description>This field determines how long the DMA will remain active during deep sleep before shutting down and returning the system to full deep sleep. Values are based on a 94KHz clock and are roughly 10 us increments for a range of ~10 us to 2.55 ms</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

