pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>DECODEABORT</name>
              <description>APB Decode Abort. When set, the APB bridge will issue a data abort (bus fault) on transactions to peripherals that are powered down. When set to 0, writes are quietly discarded and reads return 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Bus operations to powered down peripherals are quietly discarded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Bus operations to powered down peripherals result in a bus fault.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_ENABLE</name>
              <description>Enable the DMA controller. When disabled, DMA requests will be ignored by the controller</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DMA operations disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA operations enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMMODE</name>
          <description>SRAM Controller mode bits</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000033</resetMask>

          <fields>
            <field>
              <name>DPREFETCH_CACHE</name>
              <description>Secondary pre-fetch feature that will cache pre-fetched data across bus wait states (requires DPREFETCH to be set).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPREFETCH</name>
              <description>When set, data bus accesses to the SRAM banks will be pre-fetched (normally 2 cycle read access). Use of this mode bit is only recommended if the work flow has a large number of sequential accesses.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPREFETCH_CACHE</name>
              <description>Secondary pre-fetch feature that will cache pre-fetched data across bus wait states (requires IPREFETCH to be set).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPREFETCH</name>
              <description>When set, instruction accesses to the SRAM banks will be pre-fetched (normally 2 cycle read access). Generally, this mode bit should be set for improved performance when executing instructions from SRAM.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>KEXTCLKSEL</name>
          <description>Locks the state of the EXTCLKSEL register from writes. This is done to prevent errant writes to the register, as this could cause the chip to halt. Write a value of 0x53 to unlock write access to the EXTCLKSEL register. Once unlocked, the register will read back a 1 to indicate this is unlocked. Writing the register with any other value other than 0x53 will enable the lock.</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEXTCLKSEL</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value to unlock the register.</description>
                  <value>83</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK1</name>
          <description>SIMO Buck Control Reg 1</description>
          <addressOffset>0x00000350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x38208200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CORETEMPCOTRIM</name>
              <description>simobuck_core_tempco_trim</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKMEMLPTRIM</name>
              <description>simobuck_mem_lp_trim</description>
              <bitRange>[27:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMACTIVETRIM</name>
              <description>simobuck_mem_active_trim (VDDC)</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPTRIM</name>
              <description>simobuck_core_lp_trim</description>
              <bitRange>[15:10]</bitRange>
              <access>read-write</access>

