pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>COREACTIVETRIM</name>
              <description>simobuck_core_active_trim (VDDF)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK2</name>
          <description>SIMO Buck Control Reg 2</description>
          <addressOffset>0x00000354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00AA0010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RESERVED_RW_30</name>
              <description>Reserved bits, always leave unchanged. The SIMOBUCK2 register must be modified via atomic RMW, leaving this bit field completely unmodified. Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELEAKAGETRIM</name>
              <description>simobuck_core_leakage_trim</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED_RW_24</name>
              <description>Reserved bits, always leave unchanged. The SIMOBUCK2 register must be modified via atomic RMW, leaving this bit field completely unmodified. Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPLOWTONTRIM</name>
              <description>simobuck_core_lp_low_ton_trim</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPHIGHTONTRIM</name>
              <description>simobuck_core_lp_high_ton_trim</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED_RW_5</name>
              <description>Reserved bits, always leave unchanged. The SIMOBUCK2 register must be modified via atomic RMW, leaving this bit field completely unmodified. Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[15:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKTONGENTRIM</name>
              <description>simobuck_tongen_trim</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK3</name>
          <description>SIMO Buck Control Reg 3</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5000AAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RESERVED_RW_31</name>
              <description>Reserved bits, always leave unchanged. The SIMOBUCK2 register must be modified via atomic RMW, leaving this bit field completely unmodified. Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKMEMLPHIGHTONTRIM</name>
              <description>simobuck_mem_lp_high_ton_trim</description>
              <bitRange>[30:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED_RW_16</name>
              <description>Reserved bits, always leave unchanged. The SIMOBUCK3 register must be modified via atomic RMW, leaving this bit field completely unmodified. Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKMEMLPLOWTOFFTRIM</name>
              <description>simobuck_mem_lp_low_toff_trim</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKMEMLPHIGHTOFFTRIM</name>
              <description>simobuck_mem_lp_high_toff_trim</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPLOWTOFFTRIM</name>
              <description>simobuck_core_lp_low_toff_trim</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCORELPHIGHTOFFTRIM</name>
              <description>simobuck_core_lp_high_toff_trim</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK4</name>
          <description>SIMO Buck Control Reg 4</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C8D80AA</resetValue>
          <resetMask>0x01E0000F</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKCOMP2TIMEOUTEN</name>
              <description>simobuck_comp2_timeout_en</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKCOMP2LPEN</name>
              <description>simobuck_comp2_lp_en</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

