pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>IN3</name>
              <description>Data Input pad 3 pin muxing: 0=pad[3] 1=pad[7]</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN2</name>
              <description>Data Input pad 2 pin muxing: 0=pad[2] 1=pad[6]</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN1</name>
              <description>Data Input pad 1 pin muxing: 0=pad[1] 1=pad[5]</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN0</name>
              <description>Data Input pad 0 pin muxing:  0=pad[0] 1=pad[4] 2=pad[1] 3=pad[5]</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT7</name>
              <description>Output pad 7 configuration. 0=data[7] 1=data[3]</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT6</name>
              <description>Output pad 6 configuration. 0=data[6] 1=data[2]</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT5</name>
              <description>Output pad 5 configuration. 0=data[5] 1=data[1]</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT4</name>
              <description>Output pad 4 configuration. 0=data[4] 1=data[0]</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT3</name>
              <description>Output pad 3 configuration. 0=data[3] 1=CLK</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PADOUTEN</name>
          <description>Enable bits for the MSPI output pads. Each active MSPI line should be set to 1 in the OUTEN field below.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>OUTEN</name>
              <description>Output pad enable configuration. Indicates which pads should be driven. Bits [3:0] are Quad0 data, [7:4] are Quad1 data, and [8] is clock.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad0 (4 data + 1 clock)</description>
                  <value>271</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad1 (4 data + 1 clock)</description>
                  <value>496</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL</name>
                  <description>Octal (8 data + 1 clock)</description>
                  <value>511</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>259</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL1</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>304</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH</name>
          <description>When any SPI flash is configured, this register must be properly programmed before XIP or AUTO DMA operations commence.</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0B060000</resetValue>
          <resetMask>0xFFFF07FD</resetMask>

          <fields>
            <field>
              <name>READINSTR</name>
              <description>Read command sent to flash for DMA/XIP operations</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WRITEINSTR</name>
              <description>Write command sent for DMA operations</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPMIXED</name>
              <description>Provides override controls for data operations where instruction, address, and data may transfer in different rates.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Transfers all proceed using the settings in DEVCFG register (everything in the same data rate)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Data operations proceed in dual data rate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD2</name>
                  <description>Address and Data operations proceed in dual data rate</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Data operations proceed in quad data rate</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Address and Data operations proceed in quad data rate</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPSENDI</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an instruction (see READINSTR field and ISIZE field in CFG)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

