pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>XIPSENDA</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an an address phase (see DMADEVADDR register and ASIZE field in CFG)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENTURN</name>
              <description>Indicates whether XIP/AUTO DMA operations should enable TX->RX turnaround cycles</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPBIGENDIAN</name>
              <description>Indicates whether XIP/AUTO DMA data transfers are in big or little endian format</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPACK</name>
              <description>Controls transmission of Micron XIP acknowledge cycles (Micron Flash devices only)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACK</name>
                  <description>No acknowledgment sent. Data IOs are tri-stated the first turnaround cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Positive acknowledgment sent. Data IOs are driven to 0 the first turnaround cycle to acknowledge XIP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATE</name>
                  <description>Negative acknowledgment sent. Data IOs are driven to 1 the first turnaround cycle to terminate XIP mode. XIPSENDI should be re-enabled for the next transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPEN</name>
              <description>Enable the XIP (eXecute In Place) function which effectively enables the address decoding of the MSPI device in the flash/cache address space at address 0x04000000-0x07FFFFFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBLING</name>
          <description>Enables data scrambling for the specified range external flash addresses. Scrambling does not impact flash access performance.</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x83FF03FF</resetMask>

          <fields>
            <field>
              <name>SCRENABLE</name>
              <description>Enables Data Scrambling Region. When 1 reads and writes to the range will be scrambled. When 0, data will be read/written unmodified. Address range is specified in 64K granularity and the START/END ranges are included within the range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCREND</name>
              <description>Scrambling region end address [25:16] (64K block granularity). The END block is the LAST block included in the scrambled address range.</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCRSTART</name>
              <description>Scrambling region start address [25:16] (64K block granularity). The START block is the FIRST block included in the scrambled address range.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>SCRERR</name>
              <description>Scrambling Alignment Error. Scrambling operations must be aligned to word (4-byte) start address.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQERR</name>
              <description>Command Queue Error Interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command Queue is Paused.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQUPD</name>
              <description>Command Queue Update Interrupt. Issued whenever the CQ performs an operation where address bit[0] is set. Useful for triggering CURIDX interrupts.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQCMP</name>
              <description>Command Queue Complete Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error Interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

