pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
          <fields>
            <field>
              <name>CACHEPWDSLP</name>
              <description>power down cache in deep sleep</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down cache in deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Retain cache in deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1PWDSLP</name>
              <description>Power-down FLASH1 in deep sleep</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>FLASH1 is powered down during deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FLASH1 is kept powered on during deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0PWDSLP</name>
              <description>Power-down FLASH0 in deep sleep</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>FLASH0 is powered down during deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FLASH0 is kept powered on during deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMPWDSLP</name>
              <description>Selects which SRAM banks are powered down in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>SRAM GROUP0 powered down (64KB-96KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>SRAM GROUP1 powered down (96KB-128KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>SRAM GROUP2 powered down (128KB-160KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>SRAM GROUP3 powered down (160KB-192KB)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>SRAM GROUP4 powered down (192KB-224KB)</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>SRAM GROUP5 powered down (224KB-256KB)</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>SRAM GROUP6 powered down (256KB-288KB)</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>SRAM GROUP7 powered down (288KB-320KB)</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP8</name>
                  <description>SRAM GROUP8 powered down (320KB-352KB)</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP9</name>
                  <description>SRAM GROUP9 powered down (352KB-384KB)</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM64K</name>
                  <description>Power-down lower 64k SRAM (64KB-128KB)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>Power-down lower 128k SRAM (64KB-192KB)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER32K</name>
                  <description>All SRAM banks but lower 32k powered down (96KB-384KB).</description>
                  <value>1022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER64K</name>
                  <description>All banks but lower 64k powered down.</description>
                  <value>1020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTLOWER128K</name>
                  <description>All banks but lower 128k powered down.</description>
                  <value>1008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All banks powered down.</description>
                  <value>1023</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMPWDSLP</name>
              <description>power down DTCM in deep sleep</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All DTCM retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0</name>
                  <description>Group0_DTCM0 powered down in deep sleep (0KB-8KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1</name>
                  <description>Group0_DTCM1 powered down in deep sleep (8KB-32KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Both DTCMs in group0 are powered down in deep sleep (0KB-32KB)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTGROUP0DTCM0</name>
                  <description>Group1 and Group0_DTCM1 are powered down in deep sleep (8KB-64KB)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Group1 DTCM powered down in deep sleep (32KB-64KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All DTCMs powered down in deep sleep (0KB-64KB)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the MEMPWDINSLEEP register. When this register is set, then the MEMPWRINSLEEP register will determine whether power is enabled to the SRAMs in deep sleep. If this register is not set, then power will always be disabled to the memory bank.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0007FFF</resetValue>
          <resetMask>0xC0007FFF</resetMask>

          <fields>
            <field>
              <name>CACHEB2</name>
              <description>Power up Cache Bank 2. This works in conjunction with Cache enable from flash_cache module. To power up cache bank 2, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEB0</name>
              <description>Power up Cache Bank 0. This works in conjunction with Cache enable from flash_cache module. To power up cache bank 0, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1</name>
              <description>Power up FLASH1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up FLASH1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down FLASH1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0</name>
              <description>Power up FLASH0</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up FLASH0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down FLASH0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM</name>
              <description>Power up SRAM groups</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not power ON any of the SRAM banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only SRAM group0 (0KB-32KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only SRAM group1 (32KB-64KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>Power ON only SRAM group2 (64KB-96KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3</name>
                  <description>Power ON only SRAM group3 (96KB-128KB)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4</name>
                  <description>Power ON only SRAM group4 (128KB-160KB)</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5</name>
                  <description>Power ON only SRAM group5 (160KB-192KB)</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6</name>
                  <description>Power ON only SRAM group6 (192KB-224KB)</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7</name>
                  <description>Power ON only SRAM group7 (224KB-256KB)</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP8</name>
                  <description>Power ON only SRAM group8 (256KB-288KB)</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP9</name>
                  <description>Power ON only SRAM group9 (288KB-320KB)</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM64K</name>
                  <description>Power ON only lower 64k</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM128K</name>
                  <description>Power ON only lower 128k</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM256K</name>
                  <description>Power ON only lower 256k</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All SRAM banks (320K) powered ON</description>
                  <value>1023</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM</name>
              <description>Power up DTCM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any DTCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0</name>
                  <description>Power ON only GROUP0_DTCM0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1</name>
                  <description>Power ON only GROUP0_DTCM1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only DTCMs in group0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only DTCMs in group1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Power ON all DTCMs</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWRSTATUS</name>
          <description>It provides the power status for all the memory banks including- caches, FLASH (0 and 1) and all the SRAM groups. The status here should reflect the enable provided by the MEMPWREN register. There may be a lag time between setting the bits in MEMPWREN register and MEMPWRSTATUS register, due to the need to cycle the power gate and isolation sequences to the memory banks.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007FFF</resetValue>
          <resetMask>0x0001FFFF</resetMask>

          <fields>
            <field>
              <name>CACHEB2</name>
              <description>This bit is 1 if power is supplied to Cache Bank 2</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

