pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>CACHEB0</name>
              <description>This bit is 1 if power is supplied to Cache Bank 0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1</name>
              <description>This bit is 1 if power is supplied to FLASH 1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0</name>
              <description>This bit is 1 if power is supplied to FLASH 0</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM9</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP9</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM8</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP8</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM7</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP7</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM6</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP6</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM5</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP5</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM4</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP4</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM3</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP3</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM2</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM1</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP1</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAM0</name>
              <description>This bit is 1 if power is supplied to SRAM GROUP0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTCM1</name>
              <description>This bit is 1 if power is supplied to DTCM GROUP1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTCM01</name>
              <description>This bit is 1 if power is supplied to DTCM GROUP0_1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTCM00</name>
              <description>This bit is 1 if power is supplied to DTCM GROUP0_0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEVPWRSTATUS</name>
          <description>This provides the power status for the peripheral devices- BLEL, PDM, PDM, MSPI, SCARD, ADC, UART0 and 1, IOM5 to 0, IOSLAVE and MCUL (DMA and Fabrics) and MCUH (ARM core). The status here should reflect the enable provided by the DEVPWREN register. There may be a lag time between setting the bits in DEVPWREN register and DEVPWRSTATUS register, due to the need to cycle the power gate, isolation and reset sequences to the device power domains.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>BLEH</name>
              <description>This bit is 1 if power is supplied to BLEH</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLEL</name>
              <description>This bit is 1 if power is supplied to BLEL</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRPDM</name>
              <description>This bit is 1 if power is supplied to PDM</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRMSPI</name>
              <description>This bit is 1 if power is supplied to MSPI</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRADC</name>
              <description>This bit is 1 if power is supplied to ADC</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

