pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>RSTGEN</name>
      <version>1.0</version>
      <description>MCU Reset Generator</description>
      <!-- <groupName>GROUP_RSTGEN</groupName> -->
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0FFFF004</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CFG</name>
          <description>Reset configuration register.  This controls the reset enables for brownout condition, and for the expiration of the watch dog timer.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>WDREN</name>
              <description>Watchdog Timer Reset Enable.  NOTE: The WDT module must also be configured for WDT reset.  This includes enabling the RESEN bit in WDTCFG register in Watch dog timer block.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHREN</name>
              <description>Brown out high (2.1 V) reset enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SWPOI</name>
          <description>This is the software POI reset.  writing the key value to this register will trigger a POI to the system.  This will cause a reset to all blocks except for registers in clock gen, RTC and the STIMER.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPOIKEY</name>
              <description>0x1B generates a software POI reset.  This is a write-only register.  Reading from this register will yield only all 0's.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0x1B key value generates a software POI reset.</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPOR</name>
          <description>This is the software POR reset.  Writing the key value to this register will trigger a POR to the system.  This will cause a reset to all blocks except for registers in clock gen, RTC, power management unit, the STIMER, and the power management unit.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPORKEY</name>
              <description>0xD4 generates a software POR reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0xD4 key value generates a software POR reset.</description>
                  <value>212</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPIURST</name>
          <description>This will trigger a reset for the TPIU unit.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>TPIURST</name>
              <description>Static reset for the TPIU. Write to '1' to assert reset to TPIU. Write to '0' to clear the reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

