pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <description>UART Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>OESTAT</name>
              <description>This is the overrun error indicator.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART OESTAT, overrun error indicator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART OESTAT, overrun error indicator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BESTAT</name>
              <description>This is the break error indicator.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART BESTAT, break error indicator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART BESTAT, break error indicator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PESTAT</name>
              <description>This is the parity error indicator.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART PESTAT, parity error indicator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART PESTAT, parity error indicator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FESTAT</name>
              <description>This is the framing error indicator.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No error on UART FESTAT, framing error indicator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error on UART FESTAT, framing error indicator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Flag</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>TXBUSY</name>
              <description>This bit holds the transmit BUSY indicator.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFE</name>
              <description>This bit holds the transmit FIFO empty indicator.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XMTFIFO_EMPTY</name>
                  <description>Transmit FIFO is empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFF</name>
              <description>This bit holds the receive FIFO full indicator.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCVFIFO_FULL</name>
                  <description>Receive FIFO is full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFF</name>
              <description>This bit holds the transmit FIFO full indicator.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XMTFIFO_FULL</name>
                  <description>Transmit FIFO is full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>This bit holds the receive FIFO empty indicator.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCVFIFO_EMPTY</name>
                  <description>Receive FIFO is empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>This bit holds the busy indicator.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>UART busy indicator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCD</name>
              <description>This bit holds the data carrier detect indicator.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECTED</name>
                  <description>Data carrier detect detected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSR</name>
              <description>This bit holds the data set ready indicator.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Data set ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTS</name>
              <description>This bit holds the clear to send indicator.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEARTOSEND</name>
                  <description>Clear to send is indicated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ILPR</name>
          <description>IrDA Counter</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ILPDVSR</name>
              <description>These bits hold the IrDA counter divisor.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

