pyocd/pyOCD/pyocd/debug/svd/data/apollo3.svd
            </field>
            <field>
              <name>FEIC</name>
              <description>This bit holds the framing error interrupt clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTIC</name>
              <description>This bit holds the receive timeout interrupt clear.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIC</name>
              <description>This bit holds the transmit interrupt clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXIC</name>
              <description>This bit holds the receive interrupt clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMIC</name>
              <description>This bit holds the modem DSR interrupt clear.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMIC</name>
              <description>This bit holds the modem DCD interrupt clear.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMIC</name>
              <description>This bit holds the modem CTS interrupt clear.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMIC</name>
              <description>This bit holds the modem TXCMP interrupt clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x4001D000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <value>16</value>
        <!--  <description>UART1 IRQ</description>  -->
      </interrupt>
    </peripheral>

    <peripheral>
      <name>VCOMP</name>
      <version>1.0</version>
      <description>Voltage Comparator</description>
      <!-- <groupName>GROUP_VCOMP</groupName> -->
      <baseAddress>0x4000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VCOMP</name>
        <value>3</value>
        <!--  <description>VCOMP IRQ</description>  -->
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>The Voltage Comparator Configuration Register contains the software control for selecting between the 4 options for the positive input as well as the multiple options for the reference input.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0303</resetMask>

          <fields>
            <field>
              <name>LVLSEL</name>
              <description>When the reference input NSEL is set to NSEL_DAC, this bit field selects the voltage level for the negative input to the comparator.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P58V</name>
                  <description>Set Reference input to 0.58 Volts.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P77V</name>
                  <description>Set Reference input to 0.77 Volts.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P97V</name>
                  <description>Set Reference input to 0.97 Volts.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P16V</name>
                  <description>Set Reference input to 1.16 Volts.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P35V</name>
                  <description>Set Reference input to 1.35 Volts.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P55V</name>
                  <description>Set Reference input to 1.55 Volts.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P74V</name>
                  <description>Set Reference input to 1.74 Volts.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P93V</name>
                  <description>Set Reference input to 1.93 Volts.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P13V</name>
                  <description>Set Reference input to 2.13 Volts.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P32V</name>
                  <description>Set Reference input to 2.32 Volts.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P51V</name>
                  <description>Set Reference input to 2.51 Volts.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P71V</name>
                  <description>Set Reference input to 2.71 Volts.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P90V</name>
                  <description>Set Reference input to 2.90 Volts.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P09V</name>
                  <description>Set Reference input to 3.09 Volts.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P29V</name>
                  <description>Set Reference input to 3.29 Volts.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P48V</name>
                  <description>Set Reference input to 3.48 Volts.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSEL</name>
              <description>This bit field selects the negative input to the comparator.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREFEXT1</name>
                  <description>Use external reference 1 for reference input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT2</name>
                  <description>Use external reference 2 for reference input.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT3</name>
                  <description>Use external reference 3 for reference input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>Use DAC output selected by LVLSEL for reference input.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>This bit field selects the positive input to the comparator.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDADJ</name>
                  <description>Use VDDADJ for the positive input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP</name>
                  <description>Use the temperature sensor output for the positive input. Note: If this channel is selected for PSEL, the bandgap circuit required for temperature comparisons will automatically turn on. The bandgap circuit requires 11 us to stabilize.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT1</name>
                  <description>Use external voltage 0 for positive input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT2</name>
                  <description>Use external voltage 1 for positive input.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWDSTAT</name>
              <description>This bit indicates the power down state of the voltage comparator.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>The voltage comparator is powered down.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPOUT</name>
              <description>This bit is 1 if the positive input of the comparator is greater than the negative input.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOUT_LOW</name>
                  <description>The negative input of the comparator is greater than the positive input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOUT_HIGH</name>
                  <description>The positive input of the comparator is greater than the negative input.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDKEY</name>
          <description>Write a value of 0x37 to unlock, write any other value to lock. This register also indicates lock status when read. When in the unlocked state (i.e. 0x37 has been written), it reads as 1. When in the locked state, it reads as 0.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PWDKEY</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value to unlock the register.</description>
                  <value>55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

